In [1]:
# How to add rows and delete the rows

In [1]:
import pandas as pd
d=pd.DataFrame({"Name":["p1","p2","p3","p4"],"Gender":["m","f","f","m"],"Age":[21,2,3,4],"Salary":["25k","30k","35k","40k"]})

In [2]:
d

  Name Gender  Age Salary
0   p1      m   21    25k
1   p2      f    2    30k
2   p3      f    3    35k
3   p4      m    4    40k

In [5]:
d.append(["p5","m",1,"20k"])

C:\Users\SSS\AppData\Local\Temp\ipykernel_10952\4053327014.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d.append(["p5","m",1,"20k"])

  Name Gender   Age Salary    0
0   p1      m  21.0    25k  NaN
1   p2      f   2.0    30k  NaN
2   p3      f   3.0    35k  NaN
3   p4      m   4.0    40k  NaN
0  NaN    NaN   NaN    NaN   p5
1  NaN    NaN   NaN    NaN    m
2  NaN    NaN   NaN    NaN    1
3  NaN    NaN   NaN    NaN  20k

In [10]:
d.append([["p5","m",1,"20k"]])

C:\Users\SSS\AppData\Local\Temp\ipykernel_10952\1735883179.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d.append([["p5","m",1,"20k"]])

  Name Gender   Age Salary    0    1    2    3
0   p1      m  21.0    25k  NaN  NaN  NaN  NaN
1   p2      f   2.0    30k  NaN  NaN  NaN  NaN
2   p3      f   3.0    35k  NaN  NaN  NaN  NaN
3   p4      m   4.0    40k  NaN  NaN  NaN  NaN
0  NaN    NaN   NaN    NaN   p5    m  1.0  20k

In [14]:
d.append([["p5","m",1,"20k"]],ignore_index=True)

C:\Users\SSS\AppData\Local\Temp\ipykernel_10952\3430509337.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d.append([["p5","m",1,"20k"]],ignore_index=True)

  Name Gender   Age Salary    0    1    2    3
0   p1      m  21.0    25k  NaN  NaN  NaN  NaN
1   p2      f   2.0    30k  NaN  NaN  NaN  NaN
2   p3      f   3.0    35k  NaN  NaN  NaN  NaN
3   p4      m   4.0    40k  NaN  NaN  NaN  NaN
4  NaN    NaN   NaN    NaN   p5    m  1.0  20k

In [7]:
d1=pd.DataFrame([[1,2,3],[4,5,6],[5,6,7]])

In [8]:
d1

   0  1  2
0  1  2  3
1  4  5  6
2  5  6  7

In [9]:
d1.append([[100,200,300]])

C:\Users\SSS\AppData\Local\Temp\ipykernel_10952\468951499.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1.append([[100,200,300]])

     0    1    2
0    1    2    3
1    4    5    6
2    5    6    7
0  100  200  300

In [11]:
d1.append([[100,200,300],[400,500,600]])

C:\Users\SSS\AppData\Local\Temp\ipykernel_10952\2483984867.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1.append([[100,200,300],[400,500,600]])

     0    1    2
0    1    2    3
1    4    5    6
2    5    6    7
0  100  200  300
1  400  500  600

In [12]:
d1=d1.append([[100,200,300],[400,500,600]],ignore_index=True)

C:\Users\SSS\AppData\Local\Temp\ipykernel_10952\1572556392.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1=d1.append([[100,200,300],[400,500,600]],ignore_index=True)

In [13]:
d1

     0    1    2
0    1    2    3
1    4    5    6
2    5    6    7
3  100  200  300
4  400  500  600

In [15]:
d1[0:2]

   0  1  2
0  1  2  3
1  4  5  6

In [3]:
d.drop(2)   # drop ---> to deleting the rows

  Name Gender  Age Salary
0   p1      m   21    25k
1   p2      f    2    30k
3   p4      m    4    40k

In [4]:
d   # but the effect is not shown on orginal data df1.use inplace=True make view

  Name Gender  Age Salary
0   p1      m   21    25k
1   p2      f    2    30k
2   p3      f    3    35k
3   p4      m    4    40k

In [17]:
d.drop(2,inplace=True)   # inplace=True make view

In [18]:
d

  Name Gender  Age Salary
0   p1      m   21    25k
1   p2      f    2    30k
3   p4      m    4    40k

In [20]:
d.drop(["Name","Age"],axis=1,inplace=True)

In [21]:
d

  Gender Salary
0      m    25k
1      f    30k
3      m    40k

In [5]:
d.drop(["Name"],axis='columns',inplace=True)
d

  Gender  Age Salary
0      m   21    25k
1      f    2    30k
2      f    3    35k
3      m    4    40k

In [6]:
d.drop(columns=["Gender"],inplace=True)
d

   Age Salary
0   21    25k
1    2    30k
2    3    35k
3    4    40k

In [8]:
d.loc[1:2,"Age"]

1    2
2    3
Name: Age, dtype: int64

In [11]:
d.iloc[1:2,"Salary"]="30k"

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [26]:
d

  Gender Salary
0      m    25k
1      m    30k
3      m    40k

In [28]:
d.append({"Name":100,"Gender":"m","Age":23,"Salary":"30k"},ignore_index=True)

C:\Users\SSS\AppData\Local\Temp\ipykernel_10952\284988372.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d.append({"Name":100,"Gender":"m","Age":23,"Salary":"30k"},ignore_index=True)

  Gender Salary   Age   Name
0      m    25k   NaN    NaN
1      m    30k   NaN    NaN
2      m    40k   NaN    NaN
3      m    30k  23.0  100.0